<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest MS Company Portal and uploads a PKG into Jamf Pro.</string>
	<key>Identifier</key>
	<string>com.github.Pueo2.pkg.Company-Portal</string>
	<key>Input</key>
<dict>
	<key>CATEGORY</key>
	<string>Test - Enrollment</string>
	<key>DOWNLOADURL</key>
	<string>https://go.microsoft.com/fwlink/?linkid=</string>
	<key>INFO</key>
	<string>Company Portal was added to Jamf Pro via Autopgkr</string>
	<key>NAME</key>
	<string>Microsoft Compnay Portal</string>			
	<key>SOFTWARETITLE1</key>
	<string>Company</string>
	<key>SOFTWARETITLE2</key>
	<string>Portal</string>
	<key>VENDOR</key>
	<string>Microsoft</string>
	<key>PRODUCTID</key>
	<string>862280</string>
	<key>UPDATE_PREDICATE</key>
	<string>pkg_uploaded == True</string>
</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
 	    <dict>
		<key>Arguments</key>
	        <dict>
		<key>category_name</key>
		<string>%CATEGORY%</string>
		<key>replace_category</key>
		<string>False</string>
		<key>pkg_info</key>
		<string>%INFO%</string>
		<key>category_priority</key>
		<string>8</string>
		</dict>
		<key>Processor</key>
		<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
	    </dict>
	    <dict>
        	<key>Processor</key>
        	<string>com.github.haircut.processors/DatetimeOutputter</string>
		<key>Arguments</key>
		<dict>
        	<key>datetime_format</key>
        	<string>%A, %B %e, %Y</string>
    		</dict>
	     </dict>
	   <dict>
		<key>Processor</key>
		<string>URLDownloader</string>
		<key>Arguments</key>
		<dict>
		<key>url</key>
		<string>%DOWNLOADURL%%PRODUCTID%</string>
		<key>filename</key>
		<string>%VENDOR%-%SOFTWARETITLE1%-%SOFTWARETITLE2%.pkg</string>
		<key>pkg_category</key>
		<string>%CATEGORY%</string>
		<key>pkg_notes</key>
		<string>Uploaded via Autopkg %datetime%</string>
		<key>replace_pkg</key>
		<string>True</string>
	 	</dict>
	    </dict>
	    <dict>	   
		<key>Processor</key>
        	<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
	    </dict>
	</array>
</dict>
</plist>
