<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Google Chrome Browser for macOS</string>
	<key>Identifier</key>
	<string>local.jamf.teck.GoogleChrome-policy</string>
	<key>Input</key>
	<dict>
			<key>CATEGORY</key>
			<string>Business</string>
			<key>INFO</key>
			<string>GoogleChrome was uploaded by Ashley Paul James Jamf Administrator. If this message is not part of the Info, do not use</string>
			<key>NAME</key>
			<string>GoogleChrome</string>
            <key>DOWNLOADURL</key>
      	  	<string>https://dl.google.com/chrome/mac/universal/stable/GGRO/googlechrome.dmg</string>
			<key>POLICY_CATEGORY</key>
			<string>Business</string>
			<key>POLICY_NAME</key>
			<string>Install Latest %NAME%</string>
			<key>UPDATE_PREDICATE</key>
			<string>pkg_uploaded == True</string>
	</dict>
  <key>ParentRecipe</key>
	<string>com.github.autopkg.grahampugh-recipes.jamf.GoogleChrome-pkg-upload</string>
	<key>ParentRecipeTrustInfo</key>
  <key>MinimumVersion</key>
	<string>2.0</string>
	<key>Process</key>
  <array>
				<dict>
					<key>category_name</key>
					<string>%CATEGORY%</string>
					<key>replace_category</key>
					<string>True</string>
					<key>pkg_info</key>
					<string>%INFO%</string>
					<key>category_priority</key>
					<string>8</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
			</dict>	
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
					<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%DOWNLOADURL%</string>
					<key>filename</key>
					<string>GoogleChrome.pkg</string>
					<key>pkg_category</key>
					<string>%CATEGORY%</string>	
			    </dict>
			</dict>	
			<dict>	   
				   <key>Processor</key>
				    <string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		 </dict>
		 			<dict>
		 				<key>Arguments</key>
		 				<dict>
		 					<key>policy_name</key>
		 					<string>%POLICY_NAME%</string>
							<key>policy_template</key>
							<string>%POLICY_TEMPLATE%</string>
		 					<key>policy_category</key>
		 					<string>%POLICY_CATEGORY%</string>
		 					<key>replace_policy</key>
		 					<string>True</string>
		 				</dict>
		 				<key>Processor</key>
	 				<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		 			</dict>			
	</array>
</dict>
</plist>
