<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Teck branded TeamViewer Tensor for SS and SD. Uploads into Jamf</string>
	<key>Identifier</key>
	<string>local.jamf.teck.teamviewertensor-policy</string>
	<key>Input</key>
	<dict>
			<key>CATEGORY</key>
			<string>Business</string>
			<key>INFO</key>
			<string>TeamViewer Tensor was uploaded by Ashley Paul James Jamf Administrator. If this message is not part of the Info, do not use</string>
			<key>NAME</key>
			<string>TeamViewerTensor</string>
      <key>DOWNLOADURL</key>
      <string>https://dl.teamviewer.com/download/version_15x/CustomDesign/Install%20TeamViewer-idc6me8qb9.pkg</string>
			<key>POLICY_CATEGORY</key>
			<string>Business</string>
			<key>POLICY_NAME</key>
			<string>Install Latest %NAME%</string>
			<key>POLICY_TEMPLATE</key>
			<string>Policy_Template.xml</string>
			<key>UPDATE_PREDICATE</key>
			<string>pkg_uploaded == True</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
	 	    <dict>
				<key>Arguments</key>
				<dict>
					<key>category_name</key>
					<string>%CATEGORY%</string>
					<key>replace_category</key>
					<string>True</string>
					<key>pkg_info</key>
					<string>%INFO%</string>
					<key>category_priority</key>
					<string>8</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
			</dict>	
			<dict>
        			<key>Processor</key>
       				 <string>com.github.haircut.processors/DatetimeOutputter</string>
				<key>Arguments</key>
				<dict>
       				 <key>datetime_format</key>
       				 <string>%A, %B %e, %Y</string>
    				</dict>
  			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
					<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%DOWNLOADURL%</string>
					<key>filename</key>
					<string>TeckTeamViewerTensor.pkg</string>
					<key>pkg_category</key>
					<string>%CATEGORY%</string>
					<key>pkg_notes</key>
					<string>Unloaded via Autopkg %datetime%</string>
			    </dict>
			</dict>	
			<dict>	   
				   <key>Processor</key>
				    <string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		 </dict>
		 			<dict>
		 				<key>Arguments</key>
		 				<dict>
		 					<key>policy_name</key>
		 					<string>%POLICY_NAME%</string>
							<key>policy_template</key>
							<string>%POLICY_TEMPLATE%</string>
		 					<key>policy_category</key>
		 					<string>%POLICY_CATEGORY%</string>
		 					<key>replace_policy</key>
		 					<string>True</string>
		 				</dict>
		 				<key>Processor</key>
	 				<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		 			</dict>			
	</array>
</dict>
</plist>
